xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_uart.c
/******************************************************************************
 * @file     nano1xx_uart.c
 * @brief    NANO1xx UART driver source file
 *           
 * @version  1.0.2
 * @date     04, September, 2012
 *
 * @note
 * Copyright (C) 2012-2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdio.h>
#include "nano1xx.h"

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
#include "nano1xx_uart.h"
#include "nano1xx_sys.h"
#include "nano1xx_assert.h"


/** @addtogroup NANO1xx_Device_Driver NANO1xx Device Driver
  @{
*/

/** @addtogroup NANO1xx_UART_Driver UART Driver
  @{
*/


/** @addtogroup NANO1xx_UART_EXPORTED_FUNCTIONS UART Exported Functions
  @{
*/

/**
 *  @brief The function is used to get UART clock.
 *
 *  @param[in] None
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return clk: UART clock
 *
 *  @par Example
 *  @code
 *  //Get UART clock
 *  uint32_t clk;
 *  clk = UART_GetUartClk ();
 *  @endcode
 *
 */
uint32_t UART_GetUartClk(void)
{
	uint32_t clk =0 , div;

	div = ( (CLK->CLKDIV0 & CLK_CLKDIV0_UART_MASK) >> 8) + 1;

	switch (CLK->CLKSEL1 & CLK_CLKSEL1_UART_MASK)
	{
		case 0:  
			clk = __XTAL; /* HXT */
			break;
		case 1: 
			clk = __RTC_XTAL;  /* LXT */
			break;
		case 2:  
			clk = SYS_GetPLLClockFreq(); /* PLL */
			break;
		case 3: 
			clk = __IRC12M; /* HIRC */
			break;								
	}

	clk /= div;
	
	return clk;
}


/**
 *  @brief The function is used to set RTS setting.
 *
 *  @param[in] tUART    Specify UART0/UART1
 *  @param[in] u8Value \n
 *                     Set 0: Drive RTS pin to logic 1 (If the LEV_RTS set to low level triggered). \n
 *                            Drive RTS pin to logic 0 (If the LEV_RTS set to high level triggered). \n
 *                     Set 1: Drive RTS pin to logic 0 (If the LEV_RTS set to low level triggered). \n	
 *                            Drive RTS pin to logic 1 (If the LEV_RTS set to high level triggered). \n
 *                     Note: LEV_RTS is RTS Trigger Level. 0 is low level and 1 is high level. 
 *
 *  @param[in] u16TriggerLevel RTS Trigger Level :DRVUART_FIFO_1BYTES to DRVUART_FIFO_14BYTES
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  //Condition: Drive RTS to logic 1 in UART channel 1 and Set RTS trigger level is 1 bytes
 *  UART_SetRTS (UART_PORT1,1, DRVUART_FIFO_1BYTES);
 *  @endcode
 *
 */
void UART_SetRTS(UART_TypeDef  *tUART, uint8_t u8Value, uint16_t u16TriggerLevel)
{
	assert_param(CHECK_UART_RXTRIGGERLEVEL(u16TriggerLevel));

	tUART->MCSR &= ~UART_MCSR_LEV_RTS;
	tUART->MCSR |= u8Value & UART_MCSR_LEV_RTS;
	tUART->TLCTL &= ~UART_TLCTL_RTS_TRI_LEV;
	tUART->TLCTL |= (u16TriggerLevel << 12) & UART_TLCTL_RTS_TRI_LEV;
}	



/**
 *  @brief       The function is used to initialize UART. 
 *               It consists of baud-rate, parity, data-bits, stop-bits, rx-trigger-level and timeout interval settings.
 *
 *  @param[in]   tUART     Specify UART0/UART1
 *  @param[in]   sParam      Specify the property of UART. It includes
 *                           - \b u32BaudRate: Baud rate (Hz)
 *                           - \b u8cParity: NONE/EVEN/ODD parity \n
 *                           It could be: \n
 *                              DRVUART_PARITY_NONE (None parity) \n
 *                              DRVUART_PARITY_EVEN (Even parity) \n 
 *                              DRVUART_PARITY_ODD(Odd parity) \n  
 *                           - \b u8cDataBits: data bit setting \n
 *                             It could be: \n
 *                                DRVUART_DATA_BITS_5 (5 data bits) \n
 *                                DRVUART_DATA_BITS_6 (6 data bits) \n 
 *                                DRVUART_DATA_BITS_7 (7 data bits) \n
 *                                DRVUART_DATA_BITS_8 (8 data bits) \n
 *                           - \b u8cStopBits: stop bits setting \n
 *                             It could be: \n
 *                                DRVUART_STOPBITS_1 (1 stop bit) \n
 *                                DRVUART_STOPBITS_1_5 (1.5 stop bit) \n
 *                                DRVUART_STOPBITS_2 (2 stop bits) \n
 *                           - \b u8cRxTriggerLevel: Rx FIFO interrupt trigger Level \n
 *                             LEVEL_X_BYTE means the trigger level of UART channel is X bytes \n
 *                             It could be: \n
 *                                DRVUART_FIFO_1BYTE \n
 *                                DRVUART_FIFO_4BYTES \n
 *                                DRVUART_FIFO_8BYTES \n
 *                                DRVUART_FIFO_14BYTES \n
 *                           - \b u8TimeOut: Time out value "N". It represents N-clock cycle and the counting clock is baud rate.
 *                           - \b u8EnableDiv16: Divider 16 ENABLE/DISABLE.
 * @par Include:
 *      nano1xx_drivers/nano1xx_uart.h
 *
 * @return E_SUCCESS: Success
 *
 * @par Example: 
 * @code
 *  //Set UART0 under 115200bps, 8 data bits ,1 stop bit and none parity and 1 byte Rx trigger level settings, disable divider 16.
 *  STR_UART_T sParam; 
 *  sParam.u32BaudRate 		= 115200; 
 *  sParam.u8cDataBits 		= DRVUART_DATABITS_8; 
 *  sParam.u8cStopBits 		= DRVUART_STOPBITS_1; 
 *  sParam.u8cParity 		= DRVUART_PARITY_NONE; 
 *  sParam.u8cRxTriggerLevel	= DRVUART_FIFO_1BYTES; 
 *  sParam.u8EnableDiv16		= DISABLE; 
 *  UART_Init (UART_PORT0, &sParam);
 * @endcode
 *
*/
int32_t UART_Init(UART_TypeDef  *tUART, STR_UART_T *sParam)
{
	uint32_t clk, factor, divider;

