xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_uart.c
    /*-----------------------------------------------------------------------------------------------------*/
    /* Check UART port                                                                                     */
    /*-----------------------------------------------------------------------------------------------------*/
    assert_param(CHECK_UART_PORT(tUART));


    /*-----------------------------------------------------------------------------------------------------*/
    /* Check the supplied parity                                                                           */
    /*-----------------------------------------------------------------------------------------------------*/
    assert_param(CHECK_UART_PARITY(sParam->u32cParity));

	
    /*-----------------------------------------------------------------------------------------------------*/
    /* Check the supplied number of data bits                                                              */
    /*-----------------------------------------------------------------------------------------------------*/
    assert_param(CHECK_UART_DATABIT(sParam->u32cDataBits));

	
    /*-----------------------------------------------------------------------------------------------------*/
    /* Check the supplied number of stop bits                                                              */
    /*-----------------------------------------------------------------------------------------------------*/
    assert_param(CHECK_UART_STOPBIT(sParam->u32cStopBits));


    /*-----------------------------------------------------------------------------------------------------*/
    /* Check the supplied nember of trigger level bytes                                                    */
    /*-----------------------------------------------------------------------------------------------------*/
    assert_param(CHECK_UART_RXTRIGGERLEVEL(sParam->u32cRxTriggerLevel));				
	
	if(tUART == UART0)
	{
		/* Reset IP */
		GCR->IPRST_CTL2 |= GCR_IPRSTCTL2_UART0;
		GCR->IPRST_CTL2 &= ~GCR_IPRSTCTL2_UART0;
		
		/* Enable UART clock */
		CLK->APBCLK |= CLK_APBCLK_UART0_EN;
	}
	else
	{
		/* Reset IP */
		GCR->IPRST_CTL2 |= GCR_IPRSTCTL2_UART1;
		GCR->IPRST_CTL2 &= ~GCR_IPRSTCTL2_UART1;
		
		/* Enable UART clock */
		CLK->APBCLK |= CLK_APBCLK_UART1_EN;
	}
	
	/* Tx FIFO Reset & Rx FIFO Reset & FIFO Mode Enable */
	tUART->CTL |= UART_CTL_RX_RST;
  	tUART->CTL |= UART_CTL_TX_RST;

	/* Set Rx Trigger Level, Parity & Data bits & Stop bits */
	tUART->TLCTL = ((sParam->u32cRxTriggerLevel << 8) |
					(sParam->u32cParity << 3) |
					(sParam->u32cStopBits << 2) |
					(sParam->u32cDataBits) );
	
	/* Set Time-Out */
	tUART->TMCTL &= ~UART_TMCTL_TOIC;
	tUART->TMCTL |= sParam->u8TimeOut & UART_TMCTL_TOIC;

	/* Set BaudRate */
	clk = UART_GetUartClk();

	if (sParam->u8EnableDiv16 == 1)
	{
		factor = 16 * sParam->u32BaudRate;
		tUART->BAUD |= UART_BAUD_DIV_16_EN; 
	}
	else
	{
		factor = sParam->u32BaudRate;
		tUART->BAUD &= ~UART_BAUD_DIV_16_EN;
	}
	
	divider = (clk / factor) - 1;
	if ((clk % factor) >= (factor / 2))
		divider++;

	if (divider > 0xFFF)
	{
		tUART->BAUD |= UART_BAUD_DIV_16_EN;
		divider = divider / 16;
	}

	tUART->BAUD &= ~(UART_BAUD_BRD);
	tUART->BAUD |= divider & UART_BAUD_BRD;

	return E_SUCCESS;
}



/**
 *  @brief The function is used to disable UART clock, disable ISR and clear callback function pointer after checking the TX empty.
 *
 *  @param[in] tUART     Specify UART0/UART1
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return None
 *
 *  @par Example:
 *  @code
 *   //Close UART channel 0
 *   UART_DeInit (UART_PORT0);
 *  @endcode
 *
 */
void UART_DeInit(UART_TypeDef  *tUART)
{
	while(!(tUART->FSR & UART_FSR_TE_F));

	if(tUART == UART1)
	{
		CLK->APBCLK &= ~CLK_APBCLK_UART1_EN;
        NVIC_DisableIRQ (UART1_IRQn); 
	}
	else
	{
		CLK->APBCLK &= ~CLK_APBCLK_UART0_EN;
        NVIC_DisableIRQ(UART0_IRQn); 
	}

}



/**
 *  @brief The function is used to enable specified UART interrupt and enable NVIC UART IRQ.
 *
 *  @param[in] tUART             Specify UART0/UART1
 *  @param[in] u32InterruptFlag  \n
 *                               \b DRVUART_LININT    : LIN Interrupt Enable \n
 *                               \b DRVUART_ABAUDINT  : Auto-Baud Rate Interrupt Enable \n
 *                               \b DRVUART_WAKEINT   : Wakeup Interrupt \n
 *                               \b DRVUART_BUFERRINT : Buffer Error Interrupt Enable \n
 *                               \b DRVUART_TOUTINT   : Time-out Interrupt Enable \n
 *                               \b DRVUART_MOSINT    : MODEM Status Interrupt Enable \n
 *                               \b DRVUART_RLSNT     : Receive Line Status Interrupt Enable \n
 *                               \b DRVUART_THREINT   : Transmit Holding Register Empty Interrupt Enable \n
 *                               \b DRVUART_RDAINT    : Receive Data Available Interrupt Enable 
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return None
 *
 *  @note Use "|" to connect the interrupt flags to enable multiple interrupts simultaneously. \n
 *        If you call the function twice in a project, the settings is dependent on the second setting.
 *
 *  @par Example:
 *  @code
 *   //Enable UART channel 0 RDA and THRE interrupt.
 *   UART_EnableInt(UART_PORT0, (DRVUART_RDAINT | DRVUART_THREINT ) );
 *
 *  @endcode
 */
void UART_EnableInt(UART_TypeDef  *tUART, uint32_t  u32InterruptFlag)
{
	tUART->IER = u32InterruptFlag;

	if (tUART == UART0) 
	{
		NVIC_EnableIRQ(UART0_IRQn); 
	}
	else
	{
		NVIC_EnableIRQ(UART1_IRQn); 
	}
}


/**
 *  @brief The function is used to disable UART specified interrupt and disable NVIC UART IRQ.
 *
 *  @param[in] tUART            Specify UART0/UART1
 *  @param[in] u32InterruptFlag \n
 *                              \b DRVUART_LININT    : LIN Interrupt Enable \n
 *                              \b DRVUART_ABAUDINT  : Auto-Baud Rate Interrupt Enable \n
 *                              \b DRVUART_WAKEINT   : Wakeup Interrupt \n
 *                              \b DRVUART_BUFERRINT : Buffer Error Interrupt Enable \n
 *                              \b DRVUART_TOUTINT   : Time-out Interrupt Enable \n
 *                              \b DRVUART_MOSINT    : MODEM Status Interrupt Enable \n
 *                              \b DRVUART_RLSNT     : Receive Line Status Interrupt Enable \n
 *                              \b DRVUART_THREINT   : Transmit Holding Register Empty Interrupt Enable \n
 *                              \b DRVUART_RDAINT    : Receive Data Available Interrupt Enable 
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return None
 *
 *  @note Use "|" to connect the interrupt flags to disable multiple interrupts simultaneously.
 *
 *  @par Example:
 *  @code
 *   //To disable the THRE interrupt enable flag
 *   UART_DisableInt (UART_PORT0, DRVUART_THREINT);
 *  @endcode
 *
 */
void UART_DisableInt(UART_TypeDef  *tUART, uint32_t u32InterruptFlag)
{
	tUART->IER &= ~u32InterruptFlag;

	if (tUART == UART0)
	{
        NVIC_DisableIRQ(UART0_IRQn);   
	}
	else
	{
       	NVIC_DisableIRQ(UART1_IRQn);    
	}
}


/**
 *  @brief The function is used to clear UART specified interrupt flag
 *
 *  @param[in] tUART            Specify UART0/UART1
 *  @param[in] u32InterruptFlag \n
 *                              \b DRVUART_LININT    : LIN Interrupt Enable \n
 *                              \b DRVUART_ ABAUDINT : Auto-Baud Rate Interrupt Enable \n
 *                              \b DRVUART_WAKEINT   : Wakeup Interrupt \n
 *                              \b DRVUART_BUFERRINT : Buffer Error Interrupt Enable \n
 *                              \b DRVUART_MOSINT    : MODEM Status Interrupt Enable \n
 *                              \b DRVUART_RLSNT     : Receive Line Status Interrupt Enable 
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return E_SUCESS  Success
 *
 *  @par Example:
 *  @code
 *   //To clear UART0 LIN break interrupt flag.
 *   UART_ ClearIntFlag (UART_PORT0, DRVUART_LININT);
 *  @endcode
 *
 */
uint32_t UART_ClearIntFlag(UART_TypeDef  *tUART, uint32_t u32InterruptFlag)
{

