xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_uart.c
	if((u32InterruptFlag & DRVUART_RDAINT) ||
	   (u32InterruptFlag & DRVUART_TOUTINT)||
	   (u32InterruptFlag & DRVUART_THREINT))
	{
	   	return E_DRVUART_ARGUMENT;
	}	   

	if(u32InterruptFlag & DRVUART_RLSINT) /* clear Receive Line Status Interrupt */	   
	{
		tUART->FSR |= UART_FSR_BI_F | UART_FSR_FE_F | UART_FSR_PE_F;
		tUART->TRSR |= UART_TRSR_RS485_ADDET_F;
	}

	if(u32InterruptFlag & DRVUART_MOSINT)  /* clear Modem Interrupt */	   
		tUART->MCSR |= UART_MCSR_DCT_F;

    if(u32InterruptFlag & DRVUART_LININT)  /* clear LIN break Interrupt */	   
    {
		tUART->TRSR |= UART_TRSR_LIN_TX_F | UART_TRSR_LIN_RX_F | UART_TRSR_BIT_ERR_F;
    }

	if(u32InterruptFlag & DRVUART_WAKEUPINT)  /* clear wake up Interrupt */	   
		tUART->ISR |= UART_ISR_WAKE_IS;

	if(u32InterruptFlag & DRVUART_ABAUDINT)  /* clear auto-baud rate Interrupt */
	{
		tUART->TRSR |= UART_TRSR_ABAUD_TOUT_F | UART_TRSR_ABAUD_F;
	}

	if(u32InterruptFlag & DRVUART_BUFERRINT)  /* clear Buffer ErrorInterrupt */	   
	{
		tUART->FSR |= UART_FSR_RX_OVER_F | UART_FSR_TX_OVER_F;
	}
	return E_SUCCESS;
}



/**
 *  @brief The function is used to get the specified UART interrupt status
 *
 *  @param[in] tUART             Specify UART0/UART1
 *  @param[in] u32InterruptFlag  \n
 *                               \b DRVUART_LININT    : LIN Interrupt Enable \n
 *                               \b DRVUART_ABAUDINT  : Auto-Baud Rate Interrupt Enable \n
 *                               \b DRVUART_WAKEINT   : Wakeup Interrupt \n
 *                               \b DRVUART_BUFERRINT : Buffer Error Interrupt Enable \n
 *                               \b DRVUART_TOUTINT   : Time-out Interrupt Enable \n
 *                               \b DRVUART_MOSINT    : MODEM Status Interrupt Enable \n
 *                               \b DRVUART_RLSNT     : Receive Line Status Interrupt Enable \n
 *                               \b DRVUART_THREINT   : Transmit Holding Register Empty Interrupt Enable \n
 *                               \b DRVUART_RDAINT    : Receive Data Available Interrupt Enable 
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return 
 *       0: The specified interrupt did not happen \n
 *       1: The specified interrupt happened \n
 *       E_DRVUART_ARGUMENT: Error Parameter
 *
 *  @note It is recommended to poll one interrupt at a time.
 *
 *  @par Example:
 *  @code
 *   //To get the THRE interrupt enable flag.
 *   If(UART_GetIntStatus (UART_PORT0, DRVUART_THREINT))
 *      printf("THRE INT is happened!\n");
 *   else 
 *      printf("THRE INT is not happened or error parameter\n");
 *  @endcode
 *
 */
int32_t UART_GetIntStatus(UART_TypeDef  *tUART,uint32_t u32InterruptFlag)
{
	switch(u32InterruptFlag)
	{
		case DRVUART_MOSINT:				  		/* MODEM Status Interrupt */
				return ((tUART->ISR & DRVUART_MOSINT)?1:0) ;
		
		case DRVUART_RLSINT:						/* Receive Line Status Interrupt */
				return ((tUART->ISR & DRVUART_RLSINT)?1:0);

		case DRVUART_THREINT:						/* Transmit Holding Register Empty Interrupt */
				return ((tUART->ISR & DRVUART_THREINT)?1:0);

		case DRVUART_RDAINT:						/* Receive Data Available Interrupt */
				return ((tUART->ISR & DRVUART_RDAINT)?1:0);

		case DRVUART_TOUTINT:						/* Time-out Interrupt */
				return ((tUART->ISR & DRVUART_TOUTINT)?1:0);

		case DRVUART_LININT:						/* LIN Break Interrupt */
				return ((tUART->ISR & DRVUART_LININT)?1:0);

		case DRVUART_BUFERRINT:						/* Buffer Error Interrupt */
				return ((tUART->ISR & DRVUART_BUFERRINT)?1:0);

		case DRVUART_ABAUDINT:						/* Auto-baud rate Interrupt */
				return ((tUART->ISR & DRVUART_ABAUDINT)?1:0);

		case DRVUART_WAKEUPINT:					/* Wake upInterrupt */
				return ((tUART->ISR & DRVUART_WAKEUPINT)?1:0);
		
		default:
			return E_DRVUART_ARGUMENT;
	}
	
}


/**
 *  @brief The function is used to get CTS pin value and detect CTS change state
 *
 *  @param[in]  tUART             Specify UART0/UART1
 *  @param[out] pu8CTSValue       Specify the buffer to receive the CTS value.Retrun current CTS pin state
 *  @param[out] pu8CTSChangeState Specify the buffer to receive the CTS change state. 
 *                                Return CTS pin state is changed or not.
 *                                1 means changed and 0 means not yet.
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return None
 *
 *  @par Example:
 *  @code
 *  //To get CTS pin status and save to u8CTS_value. To get detect CTS change flag and save to u8CTS_state.
 *  uint8_t u8CTS_value, u8CTS_state;
 *  UART_GetCTSInfo(UART_PORT1,& u8CTS_value,& u8CTS_state);
 *  @endcode
 *
 */
void DrvUART_GetCTSInfo(UART_TypeDef  *tUART, uint8_t *pu8CTSValue, uint8_t	*pu8CTSChangeState)
{
	*pu8CTSValue 		= (tUART->MCSR & UART_MCSR_CTS_ST)?1:0 ;
	*pu8CTSChangeState 	= (tUART->MCSR & UART_MCSR_DCT_F)?1:0;
}	

 
 /**
  *  @brief The function is used to read Rx data from RX FIFO and the data will be stored in pu8RxBuf.
  *
  *  @param[in]  tUART        Specify UART0/UART1
  *
  *  @param[out] pu8RxBuf	  Specify the buffer to receive the data of receive FIFO.
  *
  *  @param[in]  u32ReadBytes Specify the read bytes number of data.
  *
  *  @par Include:
  *       nano1xx_drivers/nano1xx_uart.h
  *
  *  @return 
  * 		 E_SUCCESS: Success.\n
  * 		 E_DRVUART_TIMEOUT: FIFO polling timeout.
  *
  *  @par Example:
  *  @code
  *  //Condition: Read RX FIFO 1 byte and store in bInChar buffer. 
  *  uint8_t bInChar[1];
  *  UART_Read(UART_PORT0, bInChar,1);
  *  @endcode
  *
  */
int32_t UART_Read(UART_TypeDef  *tUART, uint8_t *pu8RxBuf, uint32_t u32ReadBytes)
{
    uint32_t  u32Count, u32delayno;

    for (u32Count=0; u32Count < u32ReadBytes; u32Count++)
    {
	     u32delayno = 0;

		 while (tUART->FSR & UART_FSR_RX_EMPTY_F) /* Check RX empty => failed */	
	     {
	     	 u32delayno++;        
	        if ( u32delayno >= 0x40000000 )        
	        	return E_DRVUART_ERR_TIMEOUT;               
            }
            pu8RxBuf[u32Count] = tUART->RBR;					    /* Get Data from UART RX  */
    }

    return E_SUCCESS;
	
