xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_uart.c
}



/**
 *  @brief The function is to write data into TX buffer to transmit data by UART
 *
 *  @param[in] tUART         Specify UART0/UART1
 *  @param[in] pu8TxBuf      Specify the buffer to send the data to UART transmission FIFO.
 *  @param[in] u32WriteBytes Specify the byte number of data.
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return 
 *          E_SUCCESS: Success
 *          E_DRVUART_TIMEOUT: FIFO polling timeout
 *
 *  @par Example:
 *  @code
 *  //Condition: Send 1 byte from bInChar buffer to TX FIFO.
 *  uint8_t bInChar[1] = 0x55;
 *  UART_Write(UART_PORT0, bInChar,1);
 *  @endcode
 *
 */
int32_t UART_Write(UART_TypeDef  *tUART, uint8_t *pu8TxBuf, uint32_t u32WriteBytes)
{
    uint32_t  u32Count, u32delayno;

    for (u32Count=0; u32Count<u32WriteBytes; u32Count++)
    {
        u32delayno = 0;

		while (!(tUART->FSR & UART_FSR_TX_EMPTY_F))  /* Wait Tx empty and Time-out manner */
        {
       	    u32delayno++;
       	    if ( u32delayno >= 0x40000000 )     	    
       	       return E_DRVUART_ERR_TIMEOUT;     	       
				   
        }
	   	tUART->THR = pu8TxBuf[u32Count]; /* Send UART Data from buffer */
    }

    return E_SUCCESS;
	
  
}


/**
 *  @brief The function is used to configure IRDA relative settings. It consists of TX or RX mode and Inverse TX or RX signals.
 *
 *  @param[in] tUART    Specify UART0/UART1
 *  @param[in] TxXSelect	Set IrDA TX mode or Rx mode\n
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h 
 *
 *  @return None
 *           
 *  @note Before using the API, you should configure UART setting firstly.
 *        And make sure the baud-rate setting is used mode 0 (UART divider is 16)in baud-rate configure.
 *
 *  @par Example:
 *  @code
 *  //Set UART1 to IRDA function and select TX mode. 
 *  UART_SetFnIRDA(UART_PORT1,IrDA_TXSelect);
 *  @endcode
 *
 */
void UART_SetFnIRDA(UART_TypeDef  *tUART, uint8_t TxXSelect)
{
	/* Enable IrDA function and configure */
	tUART->IRCR	&=  ~UART_IRCR_INV_TX;
	tUART->IRCR |= 	UART_IRCR_INV_RX;
	tUART->IRCR	= TxXSelect ? tUART->IRCR | UART_IRCR_TX_SELECT:tUART->IRCR &~ UART_IRCR_TX_SELECT;
	tUART->FUN_SEL = FUN_IRDA;	
}


/**
 *  @brief The function is used to set LIN relative setting
 *
 *  @param[in] tUART          Specify UART0/UART1
 *  @param[in] u16Mode        Specify LIN direction : MODE_TX and/or MODE_RX
 *  @param[in] u16BreakLength Specify break count value. It should be larger than 13 bit time according LIN protocol.
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h  
 *
 *  @return None
 *
 *  @par EXample:
 *  @code
 *  //Change UART1 to LIN function and set to transmit the header information.
 *  UART_SetFnLIN(uart_ch,MODE_TX | MODE_RX,13);
 *  @endcode
 *
 */
void UART_SetFnLIN(UART_TypeDef  *tUART, uint16_t u16Mode, uint16_t u16BreakLength)
{
	tUART->FUN_SEL = FUN_LIN;
	tUART->ALT_CTL &= ~(UART_ALT_CTL_LIN_TX_BCNT | UART_ALT_CTL_LIN_RX_EN | UART_ALT_CTL_LIN_TX_EN);
	tUART->ALT_CTL |= u16BreakLength & UART_ALT_CTL_LIN_TX_BCNT;
	tUART->ALT_CTL |= (u16Mode & MODE_TX) ? UART_ALT_CTL_LIN_TX_EN:0;
	tUART->ALT_CTL |= (u16Mode & MODE_RX) ? UART_ALT_CTL_LIN_RX_EN:0;

}


/**
 *  @brief The function is used to set RS485 relative setting
 *
 *  @param[in] tUART     Specify UART0/UART1
 *  @param[in] str_RS485
 *                       The structure of RS485 \n
 *                       It includes of \n
 *                       - \b u8cModeSelect: Select operation mode \n
 *                       -- MODE_RS485_NMM: RS-485 Normal Multi-drop Mode \n
 *                       -- MODE_RS485_AAD: RS-485 Auto Address Detection Mode \n
 *                       -- MODE_RS485_AUD: RS-485 Auto Direction Mode \n
 *                       - \b u8cAddrEnable: Enable or Disable RS-485 Address Detection 
 *                       - \b u8cAddrValue: Set Address match value
 *                       - \b u8cDelayTime: Set transmit delay time value
 *                       - \b u8cRxDisable: Enable or Disable receiver function.
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_uart.h
 *
 *  @return None
 *
 *  @par Example:
 *  @code
 *  //Condition: Change UART1 to RS485 function. Set relative setting as below.
 *  STR_RS485_T sParam_RS485;
 *  sParam_RS485.u8cAddrEnable 	= ENABLE; 
 *  sParam_RS485.u8cAddrValue  	= 0xC0;	 //Address 
 *  sParam_RS485.u8cModeSelect 	= MODE_RS485_AAD|MODE_RS485_AUD;
 *  sParam_RS485.u8cDelayTime  	= 0;
 *  sParam_RS485.u8cRxDisable  	= TRUE;
 *  UART_SetFnRS485(UART_PORT1,&sParam_RS485);
 *  @endcode
 *
 */
void UART_SetFnRS485(UART_TypeDef  *tUART, STR_RS485_T *str_RS485)
{
	tUART->FUN_SEL = FUN_RS485;

	tUART->ALT_CTL |= ((str_RS485->u8cAddrValue << 24) |
					   (str_RS485->u8cAddrEnable << 19) |
					   (str_RS485->u8cModeSelect  << 16));
					     
	tUART->TMCTL &= ~UART_TMCTL_DLY;
	tUART->TMCTL |= (str_RS485->u8cDelayTime << 16) & UART_TMCTL_DLY;
	tUART->CTL &= ~UART_CTL_RX_DIS;
	tUART->CTL |= (str_RS485->u8cRxDisable) ? UART_CTL_RX_DIS:0;
} 

/*@}*/ /* end of group NANO1xx_UART_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NANO1xx_UART_Driver */

/*@}*/ /* end of group NANO1xx_Device_Driver */

/*** (C) COPYRIGHT 2012 Nuvoton Technology Corp. ***/



